#+PROPERTY: header-args+ :var  CONDA_ENV="pyyton3"

* Setup development environment
:PROPERTIES:
:header-args+: :dir  .
:END:

** Create local directories

#+call: create-dir(DIR="tmp")

#+RESULTS:
: Create DIR=tmp in host='eero' on ti 24.6.2025 12.58.25 +0300
: Directory tmp created

#+call: create-dir(DIR="lib")

#+RESULTS:
: Directory lib already exists

#+call: create-dir(DIR="src")

#+RESULTS:
: Create DIR=src in host='eero' on ti 24.6.2025 12.58.31 +0300
: Directory src already exists

#+call: create-dir(DIR="spec")

#+RESULTS:
: Create DIR=spec in host='eero' on ti 24.6.2025 12.58.33 +0300
: Directory spec already exists



#+RESULTS:
: Create DIR=resources/sprite in host='eero' on la 28.12.2024 16.42.21 +0200
: Directory resources/sprite already exists

** Activate CONDA_ENV (for eglot/LSP support)

#+BEGIN_SRC bash :eval no-export :results output
echo "Running in host '$(hostname)' on $(date)"
echo "CONDA_ENV=$CONDA_ENV"
#+END_SRC

#+RESULTS:
: Running in host 'eero' on ti 24.6.2025 12.58.52 +0300
: CONDA_ENV=pyyton3


#+BEGIN_SRC elisp :eval no-export
(conda-env-activate CONDA_ENV)
#+END_SRC

#+RESULTS:
: Switched to conda environment: /home/jj/miniconda3/envs/pyyton3/

or in the shell run

#+begin_example
conda env activate pyyton3
#+end_example

** Create ~pytest.ini~ for CI

#+begin_src txt :tangle pytest.ini
# Tangled fro DEVELOPMENT - changes will be overridden
[pytest]
log_level=DEBUG
pythonpath = .
testpaths = spec
norecursedirs = .git fixtures tmp* ltximg pics pics-keep __pycache__
markers =
    slow: marks tests as slow (deselect with '-m "not slow"')
    current:Allow just one test to run
    feature: BDD test cases

# [pytest-watch]
# ignore=test/fixtures
# ext=.py,.feature
# dont-watch-files='^\.#
#+end_src

#+BEGIN_SRC bash :eval no-export :results output
echo "Running in host '$(hostname)' on $(date)"
cat pytest.ini

#+END_SRC

#+RESULTS:
#+begin_example
Running in host 'eero' on to 26.6.2025 12.26.20 +0300
# Tangled fro DEVELOPMENT - changes will be overridden
[pytest]
log_level=DEBUG
pythonpath = .
testpaths = spec
norecursedirs = .git fixtures tmp* ltximg pics pics-keep __pycache__
markers =
    slow: marks tests as slow (deselect with '-m "not slow"')
    current:Allow just one test to run
    feature: BDD test cases

# [pytest-watch]
# ignore=test/fixtures
# ext=.py,.feature
# dont-watch-files='^\.#
#+end_example

** Start CI -tests


*Continous test FAST*
#+BEGIN_SRC elisp :noweb yes :results output :eval no-export :exports none 
(start-process "server" "buf-server" "xterm" "-fa" "monaco" "-fs" "15"  "-T" "ai-smoke" "-hold" "-e"  "bash" "-c" "ptw . --now  --ignore-patterns='#*,.#*,flycheck*' -m 'not slow and not feature'")
#+END_SRC

#+RESULTS:

** rsync source code to target ~jrr5~
#+BEGIN_SRC bash :eval no-export :results output
echo "Running in $(pwd) host '$(hostname)' on $(date)"
rsync -a --delete --update --verbose --checksum --recursive jrr.py jrr5:.
rsync -a --delete --update --verbose --checksum --recursive src/ jrr5:src/
#+END_SRC

#+RESULTS:
#+begin_example
Running in /home/jj/work/jrr host 'eero' on ti 24.6.2025 13.31.30 +0300
sending incremental file list

sent 23 bytes  received 12 bytes  70,00 bytes/sec
total size is 0  speedup is 0,00
sending incremental file list
deleting apu2.sh
deleting apu.sh
deleting apu.py
deleting Python_ILI9486/__pycache__/ILI9486.cpython-311.pyc
deleting __pycache__/jrr_dapp.cpython-311.pyc
deleting __pycache__/console.cpython-311.pyc
./
config.py
firmware.py
Python_ILI9486/__pycache__/
__pycache__/
__pycache__/channel_manager.cpython-311.pyc
__pycache__/config.cpython-311.pyc
__pycache__/constants.cpython-311.pyc
__pycache__/firmware.cpython-311.pyc
__pycache__/jrr_converter.cpython-311.pyc
__pycache__/kb.cpython-311.pyc
__pycache__/messages.cpython-311.pyc
__pycache__/screen.cpython-311.pyc
__pycache__/utils.cpython-311.pyc

sent 40.181 bytes  received 1.647 bytes  16.731,20 bytes/sec
total size is 13.948.496  speedup is 333,47
#+end_example

** Some dev commands
:PROPERTIES:
:header-args+: :dir  /ssh:jrr5:
:END:

Terminal commands

#+BEGIN_SRC bash :eval no-export :results output
echo "Running in $(pwd) host '$(hostname)' on $(date)"
sudo systemctl stop jrr
#+END_SRC

#+RESULTS:
: Running in /home/pi host 'jrr5' on Sun May 18 17:31:13 EEST 2025


#+BEGIN_SRC bash :eval no-export :results output
echo "Running in $(pwd) host '$(hostname)' on $(date)"
jrr.sh status
#+END_SRC

#+RESULTS:
: Running in /home/pi host 'jrr5' on Sun May 18 17:37:52 EEST 2025
: jrr.sh: status=1/
: jrr.py: status=1/
: ffmpeg: status=1/

#+BEGIN_SRC bash :eval no-export :results output
jrr.sh status
#+END_SRC

#+RESULTS:
: jrr.sh: status=1/
: jrr.py: status=0/pi          2519    2518  0 17:37 ?        00:00:00 bash -c bash -c .venv/bin/python ./jrr.py -v -v  radio |   tee tmp/apu.log
: ffmpeg: status=1/

After ~systemctl stop jrr; jrr.sh stop~

#+begin_example
.venv/bin/python ./jrr.py -v -v  radio |   tee tmp/apu.log
#+end_example


#+BEGIN_SRC bash :eval no-export :results output
echo "Running in $(pwd) host '$(hostname)' on $(date)"
jrr.sh stop
#+END_SRC

#+BEGIN_SRC bash :eval no-export :results output
echo "Running in $(pwd) host '$(hostname)' on $(date)"
jrr.sh kill
#+END_SRC


#+RESULTS:
: Running in /home/pi host 'jrr5' on Sun May 18 17:37:46 EEST 2025

From terminal 
#+begin_example
killall ffmpeg ; .venv/bin/python ./jrr.py -v -v  radio |   tee tmp/apu.log
#+end_example

#+BEGIN_SRC elisp :noweb yes :results output :eval no-export :exports none :var TERM_HEADER="jrr5 dmesg"
   (start-process "server" "buf-server" "xterm"  "-T" "dmesg@sorsa" "-fa" "'Monospace'" "-fs" "12" "-hold" "-e"  "bash" "-c" (concat "ssh jrr5 bash -c '.venv/bin/python ./jrr.py -v -v  radio |   tee tmp/apu.log'" ) )
#+END_SRC

#+RESULTS:

** Check version

#+call: python-version()

#+RESULTS:
: hello world
: sys.version=3.11.11 | packaged by conda-forge | (main, Mar  3 2025, 20:43:55) [GCC 13.3.0]
: Conda environment=pyyton3

** Debug on jrr5
:PROPERTIES:
:header-args+: :dir  /ssh:jrr5:
:END:



Stop jrr-service

#+call: svc-stop[](SVC="jrr")

#+RESULTS:
: Stop SVC=jrr in host jrr5 on Wed Apr 30 14:04:22 EEST 2025

#+call: svc-status[](SVC="jrr")

#+RESULTS:
#+begin_example
Status of SVC=jrr in host 'jrr5' on Wed Apr 30 14:04:27 EEST 2025
○ jrr.service - Järvidio service
     Loaded: loaded (/etc/systemd/system/jrr.service; enabled; preset: enabled)
     Active: inactive (dead) since Wed 2025-04-30 09:03:56 EEST; 5h 0min ago
   Duration: 6min 54.490s
    Process: 2715 ExecStart=/home/pi/bin/jrr.sh daemon (code=killed, signal=TERM)
   Main PID: 2715 (code=killed, signal=TERM)
        CPU: 31.299s

Apr 30 08:57:02 jrr5 systemd[1]: Started jrr.service - Järvidio service.
Apr 30 08:57:02 jrr5 jrr.sh[2715]: Wed 30 Apr 08:57:02 EEST 2025: /home/pi/bin/jrr.sh|User 'pi' starting script '/home/pi/bin/jrr.sh' with parameters 'daemon' on host 'jrr5' in directory '/home/pi'
Apr 30 08:57:02 jrr5 jrr.sh[2724]: ffmpeg: no process found
Apr 30 08:57:02 jrr5 jrr.sh[2715]: Wed 30 Apr 08:57:02 EEST 2025: /home/pi/bin/jrr.sh|User 'pi' launching järviradioradio daemon
Apr 30 08:57:02 jrr5 jrr.sh[2715]: Wed 30 Apr 08:57:02 EEST 2025: /home/pi/bin/jrr.sh|User 'pi' runs CMD='.venv/bin/python ./jrr.py -v radio' in directory /home/pi with PATH='/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin'
Apr 30 09:03:56 jrr5 systemd[1]: Stopping jrr.service - Järvidio service...
Apr 30 09:03:56 jrr5 systemd[1]: jrr.service: Killing process 2740 (python) with signal SIGKILL.
Apr 30 09:03:56 jrr5 systemd[1]: jrr.service: Deactivated successfully.
Apr 30 09:03:56 jrr5 systemd[1]: Stopped jrr.service - Järvidio service.
Apr 30 09:03:56 jrr5 systemd[1]: jrr.service: Consumed 31.299s CPU time.
#+end_example

Ref

#+BEGIN_SRC bash :eval no-export :results output :var SVC="jrr"
echo "Running in $(pwd) host '$(hostname)' on $(date)"

cat /etc/systemd/system/$SVC.service

#+END_SRC

#+RESULTS:
#+begin_example
Running in /home/pi host 'jrr5' on Wed Apr 30 14:04:33 EEST 2025
[Unit]
Description=Järvidio service


[Service]
Type=simple
Restart=always
RestartSec=1
User=pi
Group=pi
WorkingDirectory=/home/pi
ExecStart=/home/pi/bin/jrr.sh daemon
StandardOutput=null
StandardError=journal

    
[Install]
WantedBy=multi-user.target

#+end_example

Notice ~/home/pi/bin/jrr.sh~

#+BEGIN_SRC bash :eval no-export :results output :
echo "Running in $(pwd) host '$(hostname)' on $(date)"
jrr.sh -?

#+END_SRC

#+RESULTS:
#+begin_example
Running in /home/pi host 'jrr5' on Wed Apr 30 14:05:03 EEST 2025

usage: jrr.sh
/home/pi/bin/jrr.sh - 0.1

Järviradioradio controller script

Usage:
/home/pi/bin/jrr.sh [options]  -- <commands>
options:
--sh_trace
--version             : print out version number && exit 0
--debug|-v            : increment DEBUG='1' level (in script /home/pi/bin/jrr.sh)
--jrr-debug           : increment JRR_DEBUG='-v' level 
--jrr-log FILE        : log file to store stdout log JRR_LOG=''
-?|--help             : usage

commands:
daemon                : Run jrr.py application
stop                  : Send kill signal to jrr.py and stop streamer process, 0
status                : Show process ids for jrr.py and ffmpeg streamer process
kill-ffmpeg           : Kill ffmpeg streamer process

Examples:


#+end_example



#+BEGIN_SRC elisp :noweb yes :results output :eval no-export :exports none 
(start-process "server" "buf-server" "xterm"  "-T" "jrr" "-fa" "'Monospace'" "-fs" "12"  "-hold" "-e"  "bash" "-c" "ssh jrr5 bin/jrr.sh daemon")
#+END_SRC

#+RESULTS:


** Automation version tag
:PROPERTIES:
:header-args:
:END:



#+BEGIN_SRC bash :eval no-export :results output :shebang #!/bin/bash :tangle .git/hooks/post-commit

# Only run if VERSION file was committed
if git diff-tree --no-commit-id --name-only -r HEAD | grep -q '^src/VERSION$'; then
    VERSION=$(cat src/VERSION)

    # Check if tag already exists
    if git rev-parse "$VERSION" >/dev/null 2>&1; then
        echo "Tag '$VERSION' already exists. Skipping tagging."
    else
        git tag "$VERSION"
        echo "Tagged commit with version: $VERSION"
    fi
fi
#+END_SRC


* Admin
** Os admin
*** ~hosti~: Hostname
Installation hostname

#+name: hosti
#+BEGIN_SRC bash :eval no-export :results output :exports both
echo $(hostname) on $(date)
#+END_SRC

#+RESULTS: hosti
: jrr5 on Tue Nov 19 13:41:36 EET 2024

#+RESULTS:
: sorsa

*** ~mem~: free memory

#+name: mem
#+BEGIN_SRC bash :eval no-export :results output
echo memory on $(hostname) on $(date)
free -h
#+END_SRC

#+RESULTS: mem
: memory on eero on ma 3.6.2024 23.00.25 +0300
:                total        used        free      shared  buff/cache   available
: Mem:            31Gi        23Gi       1,7Gi       3,2Gi       6,1Gi       4,1Gi
: Swap:          2,0Gi          0B       2,0Gi

#+RESULTS:
: sorsa
:                total        used        free      shared  buff/cache   available
: Mem:           909Mi       257Mi       139Mi        10Mi       512Mi       583Mi
: Swap:           99Mi          0B        99Mi


The RAM information of the Raspberry Pi system is also stored in the
memory information of a processor and you can retrieve this
information through the following command:
#+BEGIN_SRC bash :eval no-export :results output
cat /proc/meminfo
#+END_SRC

#+RESULTS:
#+begin_example
MemTotal:         931460 kB
MemFree:          142500 kB
MemAvailable:     597760 kB
Buffers:           23376 kB
Cached:           473824 kB
SwapCached:            0 kB
Active:            82968 kB
Inactive:         601576 kB
Active(anon):        944 kB
Inactive(anon):   197280 kB
Active(file):      82024 kB
Inactive(file):   404296 kB
Unevictable:          16 kB
Mlocked:              16 kB
SwapTotal:        102396 kB
SwapFree:         102396 kB
Dirty:                40 kB
Writeback:             0 kB
AnonPages:        187568 kB
Mapped:           136172 kB
Shmem:             10872 kB
KReclaimable:      27992 kB
Slab:              53608 kB
SReclaimable:      27992 kB
SUnreclaim:        25616 kB
KernelStack:        3852 kB
PageTables:         5636 kB
NFS_Unstable:          0 kB
Bounce:                0 kB
WritebackTmp:          0 kB
CommitLimit:      568124 kB
Committed_AS:    1234060 kB
VmallocTotal:   259653632 kB
VmallocUsed:       10988 kB
VmallocChunk:          0 kB
Percpu:              688 kB
CmaTotal:         262144 kB
CmaFree:          101604 kB
#+end_example

*** ~architecture~: Architecture

#+name: architecture
#+BEGIN_SRC bash :eval no-export :results output
uname -m
#+END_SRC

#+RESULTS: architecture
: aarch64

#+RESULTS:
: aarch64

*** ~top~:

#+name: top
#+BEGIN_SRC bash :eval no-export :results output
  echo "Top processes in host '$(hostname)' on $(date)"
  top -bn1 | head -20
#+END_SRC

#+RESULTS: top
#+begin_example
Top processes in host 'sorsa' on Wed Jun  5 02:30:54 PM EEST 2024
top - 14:30:54 up  6:15,  7 users,  load average: 0.33, 0.14, 0.10
Tasks: 226 total,   1 running, 225 sleeping,   0 stopped,   0 zombie
%Cpu(s): 11.1 us, 22.2 sy,  0.0 ni, 66.7 id,  0.0 wa,  0.0 hi,  0.0 si,  0.0 st 
MiB Mem :   7809.0 total,   6130.4 free,    500.3 used,   1314.3 buff/cache     
MiB Swap:    200.0 total,    200.0 free,      0.0 used.   7308.7 avail Mem 

    PID USER      PR  NI    VIRT    RES    SHR S  %CPU  %MEM     TIME+ COMMAND
  30759 pi        20   0   14240   4864   2816 R  11.8   0.1   0:00.04 top
      1 root      20   0  170060  13316   8760 S   0.0   0.2   0:20.17 systemd
      2 root      20   0       0      0      0 S   0.0   0.0   0:00.04 kthreadd
      3 root      20   0       0      0      0 S   0.0   0.0   0:00.00 pool_wo+
      4 root       0 -20       0      0      0 I   0.0   0.0   0:00.00 kworker+
      5 root       0 -20       0      0      0 I   0.0   0.0   0:00.00 kworker+
      6 root       0 -20       0      0      0 I   0.0   0.0   0:00.00 kworker+
      7 root       0 -20       0      0      0 I   0.0   0.0   0:00.00 kworker+
      9 root       0 -20       0      0      0 I   0.0   0.0   0:00.00 kworker+
     12 root       0 -20       0      0      0 I   0.0   0.0   0:00.00 kworker+
     13 root      20   0       0      0      0 I   0.0   0.0   0:00.00 rcu_tas+
     14 root      20   0       0      0      0 I   0.0   0.0   0:00.00 rcu_tas+
     15 root      20   0       0      0      0 I   0.0   0.0   0:00.00 rcu_tas+
#+end_example

*** ~cpu-info~: CPU info

#+name: cpu-info
#+BEGIN_SRC bash :eval no-export :results output :exports both
cat /proc/cpuinfo
#+END_SRC

#+RESULTS: cpu-info
#+begin_example
processor	: 0
BogoMIPS	: 108.00
Features	: fp asimd evtstrm crc32 cpuid
CPU implementer	: 0x41
CPU architecture: 8
CPU variant	: 0x0
CPU part	: 0xd08
CPU revision	: 3

processor	: 1
BogoMIPS	: 108.00
Features	: fp asimd evtstrm crc32 cpuid
CPU implementer	: 0x41
CPU architecture: 8
CPU variant	: 0x0
CPU part	: 0xd08
CPU revision	: 3

processor	: 2
BogoMIPS	: 108.00
Features	: fp asimd evtstrm crc32 cpuid
CPU implementer	: 0x41
CPU architecture: 8
CPU variant	: 0x0
CPU part	: 0xd08
CPU revision	: 3

processor	: 3
BogoMIPS	: 108.00
Features	: fp asimd evtstrm crc32 cpuid
CPU implementer	: 0x41
CPU architecture: 8
CPU variant	: 0x0
CPU part	: 0xd08
CPU revision	: 3

Revision	: d03115
Serial		: 100000006ca06014
Model		: Raspberry Pi 4 Model B Rev 1.5
#+end_example

#+RESULTS:
#+begin_example
processor	: 0
BogoMIPS	: 38.40
Features	: fp asimd evtstrm crc32 cpuid
CPU implementer	: 0x41
CPU architecture: 8
CPU variant	: 0x0
CPU part	: 0xd03
CPU revision	: 4

processor	: 1
BogoMIPS	: 38.40
Features	: fp asimd evtstrm crc32 cpuid
CPU implementer	: 0x41
CPU architecture: 8
CPU variant	: 0x0
CPU part	: 0xd03
CPU revision	: 4

processor	: 2
BogoMIPS	: 38.40
Features	: fp asimd evtstrm crc32 cpuid
CPU implementer	: 0x41
CPU architecture: 8
CPU variant	: 0x0
CPU part	: 0xd03
CPU revision	: 4

processor	: 3
BogoMIPS	: 38.40
Features	: fp asimd evtstrm crc32 cpuid
CPU implementer	: 0x41
CPU architecture: 8
CPU variant	: 0x0
CPU part	: 0xd03
CPU revision	: 4

Hardware	: BCM2835
Revision	: a020d3
Serial		: 0000000021bed90e
Model		: Raspberry Pi 3 Model B Plus Rev 1.3
#+end_example

*** ~kernel-version~: Kernel version

#+name: kernel-version
#+BEGIN_SRC bash :eval no-export :results output :exports both
uname -a
#+END_SRC

#+RESULTS: kernel-version
: Linux sorsa 6.6.20+rpt-rpi-v8 #1 SMP PREEMPT Debian 1:6.6.20-1+rpt1 (2024-03-07) aarch64 GNU/Linux

: Linux sorsa 5.15.84-v8+ #1613 SMP PREEMPT Thu Jan 5 12:03:08 GMT 2023 aarch64 GNU/Linux

*** ~os-version~: Operating system release

#+name: os-version
#+BEGIN_SRC bash :eval no-export :results output :exports both
cat /etc/os-release
#+END_SRC

#+RESULTS: os-version
: PRETTY_NAME="Debian GNU/Linux 12 (bookworm)"
: NAME="Debian GNU/Linux"
: VERSION_ID="12"
: VERSION="12 (bookworm)"
: VERSION_CODENAME=bookworm
: ID=debian
: HOME_URL="https://www.debian.org/"
: SUPPORT_URL="https://www.debian.org/support"
: BUG_REPORT_URL="https://bugs.debian.org/"

#+RESULTS:
: PRETTY_NAME="Debian GNU/Linux 12 (bookworm)"
: NAME="Debian GNU/Linux"
: VERSION_ID="12"
: VERSION="12 (bookworm)"
: VERSION_CODENAME=bookworm
: ID=debian
: HOME_URL="https://www.debian.org/"
: SUPPORT_URL="https://www.debian.org/support"
: BUG_REPORT_URL="https://bugs.debian.org/"

*** Forget wlan

#+BEGIN_SRC bash :eval no-export :results output
  echo "Show known wlan configs in host '$(hostname)' on $(date)"
  sudo cat /etc/wpa_supplicant/wpa_supplicant.conf
#+END_SRC

#+RESULTS:
: Show known wlan configs in host 'sorsa' on Wed Jun  5 09:07:56 PM EEST 2024
: ctrl_interface=DIR=/var/run/wpa_supplicant GROUP=netdev
: update_config=1

#+begin_example
wpa_supplicant.conf is not used with the now default Network Manager.

Left click on the network icon and select [Advance Options] then [Edit Connections]
Select the connection and click on [-].
-OR-
Use the command line tool:


sudo nmtui

#+end_example

*** ~raspi-info~

#+BEGIN_SRC bash :eval no-export :results output
echo $(hostname)
raspinfo
#+END_SRC

#+RESULTS:
#+begin_example
welleri
System Information
------------------

Raspberry Pi 4 Model B Rev 1.5
PRETTY_NAME="Debian GNU/Linux 11 (bullseye)"
NAME="Debian GNU/Linux"
VERSION_ID="11"
VERSION="11 (bullseye)"

Raspberry Pi reference 2023-05-03
Generated using pi-gen, https://github.com/RPi-Distro/pi-gen, 7c750947a959fb626a70c09fd17c65815df192ac, stage4

Linux welleri 6.1.21-v8+ #1642 SMP PREEMPT Mon Apr  3 17:24:16 BST 2023 aarch64 GNU/Linux
Revision	: c03115
Serial		: 1000000061bcfc69
Model		: Raspberry Pi 4 Model B Rev 1.5
Throttled flag  : throttled=0x0
Camera          : supported=0 detected=0, libcamera interfaces=0

Videocore information
---------------------

Mar 17 2023 10:50:39 
Copyright (c) 2012 Broadcom
version 82f3750a65fadae9a38077e3c2e217ad158c8d54 (clean) (release) (start)

alloc failures:     0
compactions:        0
legacy block fails: 0

Filesystem information
----------------------
Filesystem     1K-blocks    Used Available Use% Mounted on
/dev/root      244762244 8221472 224034748   4% /
devtmpfs         1677960       0   1677960   0% /dev
tmpfs            1942184       0   1942184   0% /dev/shm
tmpfs             776876    1328    775548   1% /run
tmpfs               5120       4      5116   1% /run/lock
/dev/sda1         258094   31155    226939  13% /boot
tmpfs             388436      20    388416   1% /run/user/1000

Filename				Type		Size		Used		Priority
/var/swap                               file		102396		0		-2

Package version information
---------------------------
raspberrypi-ui-mods:
  Installed: 1.20230127
raspberrypi-sys-mods:
  Installed: 20230510~bullseye
openbox:
  Installed: 3.6.1-9+rpt1+deb11u1
lxpanel:
  Installed: 0.10.1-2+rpt19
pcmanfm:
  Installed: 1.3.2-1+rpt9
rpd-plym-splash:
  Installed: 0.32

Networking Information
----------------------

br-af637c9bbb91: flags=4163<UP,BROADCAST,RUNNING,MULTICAST>  mtu 1500
        inet x.x.x.x  netmask x.x.x.x  broadcast x.x.x.x
        inet6 y::y.y.y.y  prefixlen 64  scopeid 0x20<link>
        ether m.m.m.m  txqueuelen 0  (Ethernet)
        RX packets 12  bytes 1203 (1.1 KiB)
        RX errors 0  dropped 0  overruns 0  frame 0
        TX packets 67  bytes 7523 (7.3 KiB)
        TX errors 0  dropped 0 overruns 0  carrier 0  collisions 0

docker0: flags=4099<UP,BROADCAST,MULTICAST>  mtu 1500
        inet x.x.x.x  netmask x.x.x.x  broadcast x.x.x.x
        ether m.m.m.m  txqueuelen 0  (Ethernet)
        RX packets 0  bytes 0 (0.0 B)
        RX errors 0  dropped 0  overruns 0  frame 0
        TX packets 0  bytes 0 (0.0 B)
        TX errors 0  dropped 0 overruns 0  carrier 0  collisions 0

eth0: flags=4163<UP,BROADCAST,RUNNING,MULTICAST>  mtu 1500
        inet x.x.x.x  netmask x.x.x.x  broadcast x.x.x.x
        inet6 y::y.y.y.y  prefixlen 64  scopeid 0x20<link>
        ether m.m.m.m  txqueuelen 1000  (Ethernet)
        RX packets 263  bytes 31027 (30.2 KiB)
        RX errors 0  dropped 0  overruns 0  frame 0
        TX packets 333  bytes 28821 (28.1 KiB)
        TX errors 0  dropped 0 overruns 0  carrier 0  collisions 0

lo: flags=73<UP,LOOPBACK,RUNNING>  mtu 65536
        inet x.x.x.x  netmask x.x.x.x
        inet6 ::1  prefixlen 128  scopeid 0x10<host>
        loop  txqueuelen 1000  (Local Loopback)
        RX packets 225  bytes 21757 (21.2 KiB)
        RX errors 0  dropped 0  overruns 0  frame 0
        TX packets 225  bytes 21757 (21.2 KiB)
        TX errors 0  dropped 0 overruns 0  carrier 0  collisions 0

vethf390115: flags=4163<UP,BROADCAST,RUNNING,MULTICAST>  mtu 1500
        inet x.x.x.x  netmask x.x.x.x  broadcast x.x.x.x
        inet6 y::y.y.y.y  prefixlen 64  scopeid 0x20<link>
        ether m.m.m.m  txqueuelen 0  (Ethernet)
        RX packets 12  bytes 1371 (1.3 KiB)
        RX errors 0  dropped 0  overruns 0  frame 0
        TX packets 211  bytes 40353 (39.4 KiB)
        TX errors 0  dropped 1 overruns 0  carrier 0  collisions 0

wlan0: flags=4163<UP,BROADCAST,RUNNING,MULTICAST>  mtu 1500
        inet x.x.x.x  netmask x.x.x.x  broadcast x.x.x.x
        inet6 y::y.y.y.y  prefixlen 64  scopeid 0x20<link>
        ether m.m.m.m  txqueuelen 1000  (Ethernet)
        RX packets 385366  bytes 30147400 (28.7 MiB)
        RX errors 0  dropped 0  overruns 0  frame 0
        TX packets 1470  bytes 236590 (231.0 KiB)
        TX errors 0  dropped 0 overruns 0  carrier 0  collisions 0


USB Information
---------------

/:  Bus 02.Port 1: Dev 1, Class=root_hub, Driver=xhci_hcd/4p, 5000M
    |__ Port 2: Dev 2, If 0, Class=Mass Storage, Driver=uas, 5000M
/:  Bus 01.Port 1: Dev 1, Class=root_hub, Driver=xhci_hcd/1p, 480M
    |__ Port 1: Dev 2, If 0, Class=Hub, Driver=hub/4p, 480M

Display Information
-------------------

Running (F)KMS and X

Screen 0: minimum 320 x 200, current 800 x 480, maximum 7680 x 7680
HDMI-1 disconnected (normal left inverted right x axis y axis)
	Identifier: 0x45
	Timestamp:  497711
	Subpixel:   unknown
	Clones:    
	CRTCs:      3
	Transform:  1.000000 0.000000 0.000000
	            0.000000 1.000000 0.000000
	            0.000000 0.000000 1.000000
	           filter: 
	Output format: Automatic 
		supported: Automatic, RGB, YCbCr 4:2:2, YCbCr 4:4:4
	Broadcast RGB: Automatic 
		supported: Automatic, Full, Limited 16:235
	max bpc: 8 
		range: (8, 12)
	bottom margin: 0 
		range: (0, 100)
	top margin: 0 
		range: (0, 100)
	right margin: 0 
		range: (0, 100)
	left margin: 0 
		range: (0, 100)
	Colorspace: Default 
		supported: Default, SMPTE_170M_YCC, BT709_YCC, XVYCC_601, XVYCC_709, SYCC_601, opYCC_601, opRGB, BT2020_CYCC, BT2020_RGB, BT2020_YCC, DCI-P3_RGB_D65, DCI-P3_RGB_Theater
	link-status: Good 
		supported: Good, Bad
	CONNECTOR_ID: 32 
		supported: 32
	non-desktop: 0 
		range: (0, 1)
HDMI-2 disconnected primary (normal left inverted right x axis y axis)
	Identifier: 0x46
	Timestamp:  497711
	Subpixel:   unknown
	Clones:    
	CRTCs:      4
	Transform:  1.000000 0.000000 0.000000
	            0.000000 1.000000 0.000000
	            0.000000 0.000000 1.000000
	           filter: 
	_MUTTER_PRESENTATION_OUTPUT: 0 
	Output format: Automatic 
		supported: Automatic, RGB, YCbCr 4:2:2, YCbCr 4:4:4
	Broadcast RGB: Automatic 
		supported: Automatic, Full, Limited 16:235
	max bpc: 8 
		range: (8, 12)
	bottom margin: 0 
		range: (0, 100)
	top margin: 0 
		range: (0, 100)
	right margin: 0 
		range: (0, 100)
	left margin: 0 
		range: (0, 100)
	Colorspace: Default 
		supported: Default, SMPTE_170M_YCC, BT709_YCC, XVYCC_601, XVYCC_709, SYCC_601, opYCC_601, opRGB, BT2020_CYCC, BT2020_RGB, BT2020_YCC, DCI-P3_RGB_D65, DCI-P3_RGB_Theater
	link-status: Good 
		supported: Good, Bad
	CONNECTOR_ID: 42 
		supported: 42
	non-desktop: 0 
		range: (0, 1)

Connector 0 (32) HDMI-A-1 (disconnected)
  Encoder 0 (31) TMDS
Connector 1 (42) HDMI-A-2 (disconnected)
  Encoder 1 (41) TMDS


HDMI0:             HDMI_HOTPLUG = 0x00000000
HDMI1:             HDMI_HOTPLUG = 0x00000000

/sys/kernel/debug/dri/1/state:
plane[47]: plane-0
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=0
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[64]: plane-1
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=0
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[75]: plane-2
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=0
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[86]: plane-3
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=0
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[97]: plane-4
	crtc=(null)
	fb=0
	crtc-pos=800x480+0+0
	src-pos=800.000000x480.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=0
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[108]: plane-5
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=0
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[119]: plane-6
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=1
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[129]: plane-7
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=2
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[139]: plane-8
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=3
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[149]: plane-9
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=4
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[159]: plane-10
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=5
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[169]: plane-11
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=6
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[179]: plane-12
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=7
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[189]: plane-13
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=8
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[199]: plane-14
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=9
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[209]: plane-15
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=a
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[219]: plane-16
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=b
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[229]: plane-17
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=c
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[239]: plane-18
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=d
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[249]: plane-19
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=e
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[259]: plane-20
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=f
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[269]: plane-21
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=10
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[279]: plane-22
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=11
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[289]: plane-23
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=11
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[299]: plane-24
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=11
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[309]: plane-25
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=11
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[319]: plane-26
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=0
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
plane[329]: plane-27
	crtc=(null)
	fb=0
	crtc-pos=0x0+0+0
	src-pos=0.000000x0.000000+0.000000+0.000000
	rotation=1
	normalized-zpos=11
	color-encoding=ITU-R BT.709 YCbCr
	color-range=YCbCr limited range
crtc[57]: txp
	enable=0
	active=0
	self_refresh_active=0
	planes_changed=0
	mode_changed=0
	active_changed=0
	connectors_changed=0
	color_mgmt_changed=0
	plane_mask=0
	connector_mask=0
	encoder_mask=0
	mode: "": 0 0 0 0 0 0 0 0 0 0 0x0 0x0
crtc[74]: pixelvalve-0
	enable=0
	active=0
	self_refresh_active=0
	planes_changed=0
	mode_changed=0
	active_changed=0
	connectors_changed=0
	color_mgmt_changed=0
	plane_mask=0
	connector_mask=0
	encoder_mask=0
	mode: "": 0 0 0 0 0 0 0 0 0 0 0x0 0x0
crtc[85]: pixelvalve-1
	enable=0
	active=0
	self_refresh_active=0
	planes_changed=0
	mode_changed=0
	active_changed=0
	connectors_changed=0
	color_mgmt_changed=0
	plane_mask=0
	connector_mask=0
	encoder_mask=0
	mode: "": 0 0 0 0 0 0 0 0 0 0 0x0 0x0
crtc[96]: pixelvalve-2
	enable=0
	active=0
	self_refresh_active=0
	planes_changed=0
	mode_changed=0
	active_changed=0
	connectors_changed=0
	color_mgmt_changed=0
	plane_mask=0
	connector_mask=0
	encoder_mask=0
	mode: "": 0 0 0 0 0 0 0 0 0 0 0x0 0x0
crtc[107]: pixelvalve-4
	enable=0
	active=0
	self_refresh_active=0
	planes_changed=1
	mode_changed=0
	active_changed=0
	connectors_changed=0
	color_mgmt_changed=0
	plane_mask=0
	connector_mask=0
	encoder_mask=0
	mode: "": 0 0 0 0 0 0 0 0 0 0 0x0 0x0
crtc[118]: pixelvalve-3
	enable=0
	active=0
	self_refresh_active=0
	planes_changed=0
	mode_changed=0
	active_changed=0
	connectors_changed=0
	color_mgmt_changed=0
	plane_mask=0
	connector_mask=0
	encoder_mask=0
	mode: "": 0 0 0 0 0 0 0 0 0 0 0x0 0x0
connector[32]: HDMI-A-1
	crtc=(null)
	self_refresh_aware=0
	max_requested_bpc=8
connector[42]: HDMI-A-2
	crtc=(null)
	self_refresh_aware=0
	max_requested_bpc=8
connector[63]: Writeback-1
	crtc=(null)
	self_refresh_aware=0
	max_requested_bpc=0



config.txt
----------

arm_64bit=1
arm_boost=1
arm_freq=1800
audio_pwm_mode=514
camera_auto_detect=1
config_hdmi_boost=5
core_freq=500
core_freq_min=200
disable_commandline_tags=2
disable_l2cache=1
disable_overscan=1
display_auto_detect=1
display_hdmi_rotate=-1
display_lcd_rotate=-1
dvfs=3
enable_gic=1
enable_uart=1
force_eeprom_read=1
force_pwm_open=1
framebuffer_ignore_alpha=1
framebuffer_swap=1
gpu_freq=500
gpu_freq_min=250
init_uart_clock=0x2dc6c00
lcd_framerate=60
mask_gpu_interrupt0=3072
mask_gpu_interrupt1=25635
max_framebuffers=2
over_voltage_avs=-10000
pause_burst_frames=1
program_serial_random=1
total_mem=4096
hdmi_force_cec_address:0=65535
hdmi_force_cec_address:1=65535
hdmi_pixel_freq_limit:0=0x11e1a300
hdmi_pixel_freq_limit:1=0x11e1a300
device_tree=-
overlay_prefix=overlays/
hdmi_cvt:0=
hdmi_cvt:1=
hdmi_edid_filename:0=
hdmi_edid_filename:1=
hdmi_timings:0=
hdmi_timings:1=

cmdline.txt
-----------
coherent_pool=1M 8250.nr_uarts=1 snd_bcm2835.enable_headphones=0 snd_bcm2835.enable_headphones=1 snd_bcm2835.enable_hdmi=1 snd_bcm2835.enable_hdmi=0  smsc95xx.macaddr=D8:3A:DD:2A:85:90 vc_mem.mem_base=0x3eb00000 vc_mem.mem_size=0x3ff00000  console=tty1 root=PARTUUID=1b6efd41-02 rootfstype=ext4 fsck.repair=yes rootwait quiet splash plymouth.ignore-serial-consoles

raspi-gpio settings
-------------------

BANK0 (GPIO 0 to 27):
GPIO 0: level=1 fsel=0 func=INPUT pull=UP
GPIO 1: level=1 fsel=0 func=INPUT pull=UP
GPIO 2: level=1 fsel=4 alt=0 func=SDA1 pull=UP
GPIO 3: level=1 fsel=4 alt=0 func=SCL1 pull=UP
GPIO 4: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 5: level=1 fsel=0 func=INPUT pull=UP
GPIO 6: level=1 fsel=0 func=INPUT pull=UP
GPIO 7: level=1 fsel=0 func=INPUT pull=UP
GPIO 8: level=1 fsel=0 func=INPUT pull=UP
GPIO 9: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 10: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 11: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 12: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 13: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 14: level=1 fsel=2 alt=5 func=TXD1 pull=NONE
GPIO 15: level=1 fsel=2 alt=5 func=RXD1 pull=UP
GPIO 16: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 17: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 18: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 19: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 20: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 21: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 22: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 23: level=1 fsel=0 func=INPUT pull=DOWN
GPIO 24: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 25: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 26: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 27: level=0 fsel=0 func=INPUT pull=DOWN
BANK1 (GPIO 28 to 45):
GPIO 28: level=1 fsel=2 alt=5 func=RGMII_MDIO pull=UP
GPIO 29: level=0 fsel=2 alt=5 func=RGMII_MDC pull=DOWN
GPIO 30: level=0 fsel=7 alt=3 func=CTS0 pull=UP
GPIO 31: level=0 fsel=7 alt=3 func=RTS0 pull=NONE
GPIO 32: level=1 fsel=7 alt=3 func=TXD0 pull=NONE
GPIO 33: level=1 fsel=7 alt=3 func=RXD0 pull=UP
GPIO 34: level=1 fsel=7 alt=3 func=SD1_CLK pull=NONE
GPIO 35: level=1 fsel=7 alt=3 func=SD1_CMD pull=UP
GPIO 36: level=1 fsel=7 alt=3 func=SD1_DAT0 pull=UP
GPIO 37: level=0 fsel=7 alt=3 func=SD1_DAT1 pull=UP
GPIO 38: level=1 fsel=7 alt=3 func=SD1_DAT2 pull=UP
GPIO 39: level=1 fsel=7 alt=3 func=SD1_DAT3 pull=UP
GPIO 40: level=0 fsel=4 alt=0 func=PWM1_0 pull=NONE
GPIO 41: level=0 fsel=4 alt=0 func=PWM1_1 pull=NONE
GPIO 42: level=0 fsel=1 func=OUTPUT pull=UP
GPIO 43: level=1 fsel=0 func=INPUT pull=UP
GPIO 44: level=1 fsel=0 func=INPUT pull=UP
GPIO 45: level=1 fsel=0 func=INPUT pull=UP
BANK2 (GPIO 46 to 53):
GPIO 46: level=0 fsel=0 func=INPUT pull=UP
GPIO 47: level=0 fsel=0 func=INPUT pull=UP
GPIO 48: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 49: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 50: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 51: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 52: level=0 fsel=0 func=INPUT pull=DOWN
GPIO 53: level=0 fsel=0 func=INPUT pull=DOWN

vcdbg log messages
------------------

005124.001: brfs: File read: /mfs/sd/config.txt
005124.985: brfs: File read: 2122 bytes
005146.458: HDMI0:EDID error reading EDID block 0 attempt 0
005147.473: HDMI0:EDID giving up on reading EDID block 0
005159.278: HDMI1:EDID error reading EDID block 0 attempt 0
005160.294: HDMI1:EDID giving up on reading EDID block 0
005161.368: brfs: File read: /mfs/sd/config.txt
005931.332: gpioman: gpioman_get_pin_num: pin DISPLAY_DSI_PORT not defined
005933.856: *** Restart logging
005933.876: brfs: File read: 2122 bytes
005939.281: hdmi: HDMI0:EDID error reading EDID block 0 attempt 0
005940.299: hdmi: HDMI0:EDID giving up on reading EDID block 0
005945.341: hdmi: HDMI0:EDID error reading EDID block 0 attempt 0
005946.357: hdmi: HDMI0:EDID giving up on reading EDID block 0
005946.375: hdmi: HDMI:hdmi_get_state is deprecated, use hdmi_get_display_state instead
005951.418: hdmi: HDMI1:EDID error reading EDID block 0 attempt 0
005952.432: hdmi: HDMI1:EDID giving up on reading EDID block 0
005957.474: hdmi: HDMI1:EDID error reading EDID block 0 attempt 0
005958.491: hdmi: HDMI1:EDID giving up on reading EDID block 0
005958.506: hdmi: HDMI:hdmi_get_state is deprecated, use hdmi_get_display_state instead
005958.520: HDMI0: hdmi_pixel_encoding: 300000000
005958.534: HDMI1: hdmi_pixel_encoding: 300000000
005958.876: kernel=
005963.775: dtb_file 'bcm2711-rpi-4-b.dtb'
005966.343: brfs: File read: /mfs/sd/bcm2711-rpi-4-b.dtb
005966.358: Loaded 'bcm2711-rpi-4-b.dtb' to 0x100 size 0xcd71
005979.445: brfs: File read: 52593 bytes
005987.992: brfs: File read: /mfs/sd/overlays/overlay_map.dtb
006068.403: brfs: File read: 2347 bytes
006069.727: brfs: File read: /mfs/sd/config.txt
006070.137: dtparam: i2c_arm=on
006078.856: dtparam: audio=on
006083.427: brfs: File read: 2122 bytes
006094.206: brfs: File read: /mfs/sd/overlays/vc4-kms-v3d-pi4.dtbo
006155.364: Loaded overlay 'vc4-kms-v3d'
006313.200: brfs: File read: 3913 bytes
006314.102: brfs: File read: /mfs/sd/cmdline.txt
006314.143: Read command line from file 'cmdline.txt':
006314.155: 'console=tty1 root=PARTUUID=1b6efd41-02 rootfstype=ext4 fsck.repair=yes rootwait quiet splash plymouth.ignore-serial-consoles'
006424.707: brfs: File read: 124 bytes
006761.416: brfs: File read: /mfs/sd/kernel8.img
006761.436: Loaded 'kernel8.img' to 0x80000 size 0x7d6bd0
007932.088: Kernel relocated to 0x200000
007932.101: Device tree loaded to 0x2eff2c00 (size 0xd3c0)
007935.297: bfs_xhci_stop
007935.305: XHCI-STOP
007935.389: xHC ver: 256 HCS: 05000420 fc000031 00e70004 HCC: 002841eb
007935.407: USBSTS 18
010015.808: vchiq_core: vchiq_init_state: slot_zero = 0xcf000000, is_master = 1

dmesg log
---------

[    0.000000] Booting Linux on physical CPU 0x0000000000 [0x410fd083]
[    0.000000] Linux version 6.1.21-v8+ (dom@buildbot) (aarch64-linux-gnu-gcc-8 (Ubuntu/Linaro 8.4.0-3ubuntu1) 8.4.0, GNU ld (GNU Binutils for Ubuntu) 2.34) #1642 SMP PREEMPT Mon Apr  3 17:24:16 BST 2023
[    0.000000] random: crng init done
[    0.000000] Machine model: Raspberry Pi 4 Model B Rev 1.5
[    0.000000] efi: UEFI not found.
[    0.000000] Reserved memory: created CMA memory pool at 0x000000000ec00000, size 512 MiB
[    0.000000] OF: reserved mem: initialized node linux,cma, compatible id shared-dma-pool
[    0.000000] Zone ranges:
[    0.000000]   DMA      [mem 0x0000000000000000-0x000000003fffffff]
[    0.000000]   DMA32    [mem 0x0000000040000000-0x00000000fbffffff]
[    0.000000]   Normal   empty
[    0.000000] Movable zone start for each node
[    0.000000] Early memory node ranges
[    0.000000]   node   0: [mem 0x0000000000000000-0x000000003b2fffff]
[    0.000000]   node   0: [mem 0x0000000040000000-0x00000000fbffffff]
[    0.000000] Initmem setup node 0 [mem 0x0000000000000000-0x00000000fbffffff]
[    0.000000] On node 0, zone DMA32: 19712 pages in unavailable ranges
[    0.000000] On node 0, zone DMA32: 16384 pages in unavailable ranges
[    0.000000] percpu: Embedded 29 pages/cpu s78504 r8192 d32088 u118784
[    0.000000] pcpu-alloc: s78504 r8192 d32088 u118784 alloc=29*4096
[    0.000000] pcpu-alloc: [0] 0 [0] 1 [0] 2 [0] 3 
[    0.000000] Detected PIPT I-cache on CPU0
[    0.000000] CPU features: detected: Spectre-v2
[    0.000000] CPU features: detected: Spectre-v3a
[    0.000000] CPU features: detected: Spectre-v4
[    0.000000] CPU features: detected: Spectre-BHB
[    0.000000] CPU features: kernel page table isolation forced ON by KASLR
[    0.000000] CPU features: detected: Kernel page table isolation (KPTI)
[    0.000000] CPU features: detected: ARM erratum 1742098
[    0.000000] CPU features: detected: ARM errata 1165522, 1319367, or 1530923
[    0.000000] alternatives: applying boot alternatives
[    0.000000] Built 1 zonelists, mobility grouping on.  Total pages: 996660
[    0.000000] Kernel command line: coherent_pool=1M 8250.nr_uarts=1 snd_bcm2835.enable_headphones=0 snd_bcm2835.enable_headphones=1 snd_bcm2835.enable_hdmi=1 snd_bcm2835.enable_hdmi=0  smsc95xx.macaddr=m.m.m.m vc_mem.mem_base=0x3eb00000 vc_mem.mem_size=0x3ff00000  console=tty1 root=PARTUUID=1b6efd41-02 rootfstype=ext4 fsck.repair=yes rootwait quiet splash plymouth.ignore-serial-consoles
[    0.000000] Unknown kernel command line parameters "splash", will be passed to user space.
[    0.000000] Dentry cache hash table entries: 524288 (order: 10, 4194304 bytes, linear)
[    0.000000] Inode-cache hash table entries: 262144 (order: 9, 2097152 bytes, linear)
[    0.000000] mem auto-init: stack:off, heap alloc:off, heap free:off
[    0.000000] software IO TLB: area num 4.
[    0.000000] software IO TLB: mapped [mem 0x0000000037300000-0x000000003b300000] (64MB)
[    0.000000] Memory: 3355924K/4049920K available (11776K kernel code, 2106K rwdata, 3688K rodata, 4160K init, 1077K bss, 169708K reserved, 524288K cma-reserved)
[    0.000000] SLUB: HWalign=64, Order=0-3, MinObjects=0, CPUs=4, Nodes=1
[    0.000000] ftrace: allocating 39744 entries in 156 pages
[    0.000000] ftrace: allocated 156 pages with 4 groups
[    0.000000] trace event string verifier disabled
[    0.000000] rcu: Preemptible hierarchical RCU implementation.
[    0.000000] rcu: 	RCU event tracing is enabled.
[    0.000000] rcu: 	RCU restricting CPUs from NR_CPUS=256 to nr_cpu_ids=4.
[    0.000000] 	Trampoline variant of Tasks RCU enabled.
[    0.000000] 	Rude variant of Tasks RCU enabled.
[    0.000000] 	Tracing variant of Tasks RCU enabled.
[    0.000000] rcu: RCU calculated value of scheduler-enlistment delay is 25 jiffies.
[    0.000000] rcu: Adjusting geometry for rcu_fanout_leaf=16, nr_cpu_ids=4
[    0.000000] NR_IRQS: 64, nr_irqs: 64, preallocated irqs: 0
[    0.000000] Root IRQ handler: gic_handle_irq
[    0.000000] GIC: Using split EOI/Deactivate mode
[    0.000000] rcu: srcu_init: Setting srcu_struct sizes based on contention.
[    0.000000] arch_timer: cp15 timer(s) running at 54.00MHz (phys).
[    0.000000] clocksource: arch_sys_counter: mask: 0xffffffffffffff max_cycles: 0xc743ce346, max_idle_ns: 440795203123 ns
[    0.000000] sched_clock: 56 bits at 54MHz, resolution 18ns, wraps every 4398046511102ns
[    0.000305] Console: colour dummy device 80x25
[    0.000367] printk: console [tty1] enabled
[    0.000428] Calibrating delay loop (skipped), value calculated using timer frequency.. 108.00 BogoMIPS (lpj=216000)
[    0.000453] pid_max: default: 32768 minimum: 301
[    0.000584] LSM: Security Framework initializing
[    0.000784] Mount-cache hash table entries: 8192 (order: 4, 65536 bytes, linear)
[    0.000844] Mountpoint-cache hash table entries: 8192 (order: 4, 65536 bytes, linear)
[    0.002095] cgroup: Disabling memory control group subsystem
[    0.004280] cblist_init_generic: Setting adjustable number of callback queues.
[    0.004298] cblist_init_generic: Setting shift to 2 and lim to 1.
[    0.004475] cblist_init_generic: Setting shift to 2 and lim to 1.
[    0.004645] cblist_init_generic: Setting shift to 2 and lim to 1.
[    0.005078] rcu: Hierarchical SRCU implementation.
[    0.005091] rcu: 	Max phase no-delay instances is 1000.
[    0.006393] EFI services will not be available.
[    0.006899] smp: Bringing up secondary CPUs ...
[    0.007991] Detected PIPT I-cache on CPU1
[    0.008144] CPU1: Booted secondary processor 0x0000000001 [0x410fd083]
[    0.009272] Detected PIPT I-cache on CPU2
[    0.009390] CPU2: Booted secondary processor 0x0000000002 [0x410fd083]
[    0.010482] Detected PIPT I-cache on CPU3
[    0.010605] CPU3: Booted secondary processor 0x0000000003 [0x410fd083]
[    0.010753] smp: Brought up 1 node, 4 CPUs
[    0.010774] SMP: Total of 4 processors activated.
[    0.010787] CPU features: detected: 32-bit EL0 Support
[    0.010796] CPU features: detected: 32-bit EL1 Support
[    0.010809] CPU features: detected: CRC32 instructions
[    0.010941] CPU: All CPU(s) started at EL2
[    0.010964] alternatives: applying system-wide alternatives
[    0.012786] devtmpfs: initialized
[    0.024729] Enabled cp15_barrier support
[    0.024768] Enabled setend support
[    0.024989] clocksource: jiffies: mask: 0xffffffff max_cycles: 0xffffffff, max_idle_ns: 7645041785100000 ns
[    0.025024] futex hash table entries: 1024 (order: 4, 65536 bytes, linear)
[    0.037552] pinctrl core: initialized pinctrl subsystem
[    0.038408] DMI not present or invalid.
[    0.039074] NET: Registered PF_NETLINK/PF_ROUTE protocol family
[    0.042592] DMA: preallocated 1024 KiB GFP_KERNEL pool for atomic allocations
[    0.042941] DMA: preallocated 1024 KiB GFP_KERNEL|GFP_DMA pool for atomic allocations
[    0.043882] DMA: preallocated 1024 KiB GFP_KERNEL|GFP_DMA32 pool for atomic allocations
[    0.043974] audit: initializing netlink subsys (disabled)
[    0.044260] audit: type=2000 audit(0.044:1): state=initialized audit_enabled=0 res=1
[    0.044857] thermal_sys: Registered thermal governor 'step_wise'
[    0.044947] cpuidle: using governor menu
[    0.045352] hw-breakpoint: found 6 breakpoint and 4 watchpoint registers.
[    0.045567] ASID allocator initialised with 32768 entries
[    0.045729] Serial: AMBA PL011 UART driver
[    0.059557] bcm2835-mbox fe00b880.mailbox: mailbox enabled
[    0.080269] raspberrypi-firmware soc:firmware: Attached to firmware from 2023-03-17T10:50:39, variant start
[    0.084283] raspberrypi-firmware soc:firmware: Firmware hash is 82f3750a65fadae9a38077e3c2e217ad158c8d54
[    0.100173] KASLR enabled
[    0.137384] bcm2835-dma fe007000.dma: DMA legacy API manager, dmachans=0x1
[    0.143142] SCSI subsystem initialized
[    0.143392] usbcore: registered new interface driver usbfs
[    0.143451] usbcore: registered new interface driver hub
[    0.143517] usbcore: registered new device driver usb
[    0.143906] usb_phy_generic phy: supply vcc not found, using dummy regulator
[    0.144136] usb_phy_generic phy: dummy supplies not allowed for exclusive requests
[    0.144493] pps_core: LinuxPPS API ver. 1 registered
[    0.144506] pps_core: Software ver. 5.3.6 - Copyright 2005-2007 Rodolfo Giometti <giometti@linux.it>
[    0.144532] PTP clock support registered
[    0.145645] vgaarb: loaded
[    0.146369] clocksource: Switched to clocksource arch_sys_counter
[    0.147378] VFS: Disk quotas dquot_6.6.0
[    0.147459] VFS: Dquot-cache hash table entries: 512 (order 0, 4096 bytes)
[    0.147640] FS-Cache: Loaded
[    0.147834] CacheFiles: Loaded
[    0.158697] NET: Registered PF_INET protocol family
[    0.159208] IP idents hash table entries: 65536 (order: 7, 524288 bytes, linear)
[    0.164158] tcp_listen_portaddr_hash hash table entries: 2048 (order: 3, 32768 bytes, linear)
[    0.164218] Table-perturb hash table entries: 65536 (order: 6, 262144 bytes, linear)
[    0.164245] TCP established hash table entries: 32768 (order: 6, 262144 bytes, linear)
[    0.164449] TCP bind hash table entries: 32768 (order: 8, 1048576 bytes, linear)
[    0.165401] TCP: Hash tables configured (established 32768 bind 32768)
[    0.165622] UDP hash table entries: 2048 (order: 4, 65536 bytes, linear)
[    0.165702] UDP-Lite hash table entries: 2048 (order: 4, 65536 bytes, linear)
[    0.166012] NET: Registered PF_UNIX/PF_LOCAL protocol family
[    0.166883] RPC: Registered named UNIX socket transport module.
[    0.166902] RPC: Registered udp transport module.
[    0.166912] RPC: Registered tcp transport module.
[    0.166922] RPC: Registered tcp NFSv4.1 backchannel transport module.
[    0.166947] PCI: CLS 0 bytes, default 64
[    0.169633] hw perfevents: enabled with armv8_cortex_a72 PMU driver, 7 counters available
[    0.170021] kvm [1]: IPA Size Limit: 44 bits
[    0.171433] kvm [1]: vgic interrupt IRQ9
[    0.171670] kvm [1]: Hyp mode initialized successfully
[    1.304106] Initialise system trusted keyrings
[    1.304547] workingset: timestamp_bits=46 max_order=20 bucket_order=0
[    1.312116] zbud: loaded
[    1.315058] NFS: Registering the id_resolver key type
[    1.315094] Key type id_resolver registered
[    1.315105] Key type id_legacy registered
[    1.315218] nfs4filelayout_init: NFSv4 File Layout Driver Registering...
[    1.315234] nfs4flexfilelayout_init: NFSv4 Flexfile Layout Driver Registering...
[    1.316655] Key type asymmetric registered
[    1.316673] Asymmetric key parser 'x509' registered
[    1.316761] Block layer SCSI generic (bsg) driver version 0.4 loaded (major 247)
[    1.317034] io scheduler mq-deadline registered
[    1.317052] io scheduler kyber registered
[    1.319224] irq_brcmstb_l2: registered L2 intc (/soc/interrupt-controller@7ef00100, parent irq: 27)
[    1.327243] brcm-pcie fd500000.pcie: host bridge /scb/pcie@7d500000 ranges:
[    1.327286] brcm-pcie fd500000.pcie:   No bus range found for /scb/pcie@7d500000, using [bus 00-ff]
[    1.327375] brcm-pcie fd500000.pcie:      MEM 0x0600000000..0x063fffffff -> 0x00c0000000
[    1.327458] brcm-pcie fd500000.pcie:   IB MEM 0x0000000000..0x00ffffffff -> 0x0400000000
[    1.328460] brcm-pcie fd500000.pcie: PCI host bridge to bus 0000:00
[    1.328480] pci_bus 0000:00: root bus resource [bus 00-ff]
[    1.328498] pci_bus 0000:00: root bus resource [mem 0x600000000-0x63fffffff] (bus address [0xc0000000-0xffffffff])
[    1.328574] pci 0000:00:00.0: [14e4:2711] type 01 class 0x060400
[    1.328830] pci 0000:00:00.0: PME# supported from D0 D3hot
[    1.332731] pci 0000:00:00.0: bridge configuration invalid ([bus 00-00]), reconfiguring
[    1.333000] pci_bus 0000:01: supply vpcie3v3 not found, using dummy regulator
[    1.333191] pci_bus 0000:01: supply vpcie3v3aux not found, using dummy regulator
[    1.333310] pci_bus 0000:01: supply vpcie12v not found, using dummy regulator
[    1.396463] brcm-pcie fd500000.pcie: link up, 5.0 GT/s PCIe x1 (SSC)
[    1.396554] pci 0000:01:00.0: [1106:3483] type 00 class 0x0c0330
[    1.396625] pci 0000:01:00.0: reg 0x10: [mem 0x00000000-0x00000fff 64bit]
[    1.396894] pci 0000:01:00.0: PME# supported from D0 D3hot
[    1.397403] pci_bus 0000:01: busn_res: [bus 01-ff] end is updated to 01
[    1.397447] pci 0000:00:00.0: BAR 8: assigned [mem 0x600000000-0x6000fffff]
[    1.397471] pci 0000:01:00.0: BAR 0: assigned [mem 0x600000000-0x600000fff 64bit]
[    1.397514] pci 0000:00:00.0: PCI bridge to [bus 01]
[    1.397535] pci 0000:00:00.0:   bridge window [mem 0x600000000-0x6000fffff]
[    1.406002] Serial: 8250/16550 driver, 1 ports, IRQ sharing enabled
[    1.409238] iproc-rng200 fe104000.rng: hwrng registered
[    1.409827] vc-mem: phys_addr:0x00000000 mem_base=0x3eb00000 mem_size:0x3ff00000(1023 MiB)
[    1.411431] gpiomem-bcm2835 fe200000.gpiomem: Initialised: Registers at 0xfe200000
[    1.424347] brd: module loaded
[    1.432985] loop: module loaded
[    1.433832] Loading iSCSI transport class v2.0-870.
[    1.439237] bcmgenet fd580000.ethernet: GENET 5.0 EPHY: 0x0000
[    1.502514] unimac-mdio unimac-mdio.-19: Broadcom UniMAC MDIO bus
[    1.503655] usbcore: registered new interface driver r8152
[    1.503736] usbcore: registered new interface driver lan78xx
[    1.503797] usbcore: registered new interface driver smsc95xx
[    1.549873] pci 0000:00:00.0: enabling device (0000 -> 0002)
[    1.550058] xhci_hcd 0000:01:00.0: xHCI Host Controller
[    1.550089] xhci_hcd 0000:01:00.0: new USB bus registered, assigned bus number 1
[    1.550850] xhci_hcd 0000:01:00.0: hcc params 0x002841eb hci version 0x100 quirks 0x0000e40000000890
[    1.551880] xhci_hcd 0000:01:00.0: xHCI Host Controller
[    1.551903] xhci_hcd 0000:01:00.0: new USB bus registered, assigned bus number 2
[    1.551925] xhci_hcd 0000:01:00.0: Host supports USB 3.0 SuperSpeed
[    1.552316] usb usb1: New USB device found, idVendor=1d6b, idProduct=0002, bcdDevice= 6.01
[    1.552336] usb usb1: New USB device strings: Mfr=3, Product=2, SerialNumber=1
[    1.552352] usb usb1: Product: xHCI Host Controller
[    1.552365] usb usb1: Manufacturer: Linux 6.1.21-v8+ xhci-hcd
[    1.552377] usb usb1: SerialNumber: 0000:01:00.0
[    1.553116] hub 1-0:1.0: USB hub found
[    1.553186] hub 1-0:1.0: 1 port detected
[    1.554156] usb usb2: New USB device found, idVendor=1d6b, idProduct=0003, bcdDevice= 6.01
[    1.554177] usb usb2: New USB device strings: Mfr=3, Product=2, SerialNumber=1
[    1.554192] usb usb2: Product: xHCI Host Controller
[    1.554204] usb usb2: Manufacturer: Linux 6.1.21-v8+ xhci-hcd
[    1.554217] usb usb2: SerialNumber: 0000:01:00.0
[    1.554936] hub 2-0:1.0: USB hub found
[    1.555032] hub 2-0:1.0: 4 ports detected
[    1.556822] dwc_otg: version 3.00a 10-AUG-2012 (platform bus)
[    1.557163] dwc_otg: FIQ enabled
[    1.557174] dwc_otg: NAK holdoff enabled
[    1.557184] dwc_otg: FIQ split-transaction FSM enabled
[    1.557203] Module dwc_common_port init
[    1.557751] usbcore: registered new interface driver uas
[    1.557868] usbcore: registered new interface driver usb-storage
[    1.558088] mousedev: PS/2 mouse device common for all mice
[    1.564640] sdhci: Secure Digital Host Controller Interface driver
[    1.564658] sdhci: Copyright(c) Pierre Ossman
[    1.565363] sdhci-pltfm: SDHCI platform and OF driver helper
[    1.569037] ledtrig-cpu: registered to indicate activity on CPUs
[    1.569407] hid: raw HID events driver (C) Jiri Kosina
[    1.569625] usbcore: registered new interface driver usbhid
[    1.569638] usbhid: USB HID core driver
[    1.578068] NET: Registered PF_PACKET protocol family
[    1.578182] Key type dns_resolver registered
[    1.579576] registered taskstats version 1
[    1.579656] Loading compiled-in X.509 certificates
[    1.580633] Key type .fscrypt registered
[    1.580648] Key type fscrypt-provisioning registered
[    1.596304] uart-pl011 fe201000.serial: there is not valid maps for state default
[    1.597018] uart-pl011 fe201000.serial: cts_event_workaround enabled
[    1.597171] fe201000.serial: ttyAMA0 at MMIO 0xfe201000 (irq = 36, base_baud = 0) is a PL011 rev2
[    1.605241] bcm2835-aux-uart fe215040.serial: there is not valid maps for state default
[    1.606132] fe215040.serial: ttyS0 at MMIO 0xfe215040 (irq = 37, base_baud = 62500000) is a 16550
[    1.607723] bcm2835-wdt bcm2835-wdt: Broadcom BCM2835 watchdog timer
[    1.608151] bcm2835-power bcm2835-power: Broadcom BCM2835 power domains driver
[    1.609426] mmc-bcm2835 fe300000.mmcnr: mmc_debug:0 mmc_debug2:0
[    1.609446] mmc-bcm2835 fe300000.mmcnr: DMA channel allocated
[    1.645314] mmc1: Controller never released inhibit bit(s).
[    1.649073] of_cfs_init
[    1.649209] of_cfs_init: OK
[    1.685870] mmc0: SDHCI controller on fe340000.mmc [fe340000.mmc] using ADMA
[    1.686216] Waiting for root device PARTUUID=1b6efd41-02...
[    1.736915] mmc1: new high speed SDIO card at address 0001
[    1.806399] usb 1-1: new high-speed USB device number 2 using xhci_hcd
[    1.956998] usb 1-1: New USB device found, idVendor=2109, idProduct=3431, bcdDevice= 4.21
[    1.957021] usb 1-1: New USB device strings: Mfr=0, Product=1, SerialNumber=0
[    1.957036] usb 1-1: Product: USB2.0 Hub
[    1.958785] hub 1-1:1.0: USB hub found
[    1.959102] hub 1-1:1.0: 4 ports detected
[    2.082882] usb 2-2: new SuperSpeed USB device number 2 using xhci_hcd
[    2.104006] usb 2-2: New USB device found, idVendor=174c, idProduct=1156, bcdDevice= 1.00
[    2.104027] usb 2-2: New USB device strings: Mfr=2, Product=3, SerialNumber=1
[    2.104043] usb 2-2: Product: Forty
[    2.104056] usb 2-2: Manufacturer: Argon
[    2.104069] usb 2-2: SerialNumber: 0000000000E4
[    2.116775] scsi host0: uas
[    2.118044] scsi 0:0:0:0: Direct-Access     Argon    Forty            0    PQ: 0 ANSI: 6
[    2.121246] sd 0:0:0:0: [sda] 500118192 512-byte logical blocks: (256 GB/238 GiB)
[    2.121441] sd 0:0:0:0: [sda] Write Protect is off
[    2.121460] sd 0:0:0:0: [sda] Mode Sense: 43 00 00 00
[    2.121796] sd 0:0:0:0: [sda] Write cache: enabled, read cache: enabled, doesn't support DPO or FUA
[    2.122264] sd 0:0:0:0: [sda] Preferred minimum I/O size 512 bytes
[    2.122282] sd 0:0:0:0: [sda] Optimal transfer size 33553920 bytes
[    2.125769]  sda: sda1 sda2
[    2.126313] sd 0:0:0:0: [sda] Attached SCSI disk
[    2.138140] EXT4-fs (sda2): INFO: recovery required on readonly filesystem
[    2.138163] EXT4-fs (sda2): write access will be enabled during recovery
[    4.679530] EXT4-fs (sda2): recovery complete
[    4.680911] EXT4-fs (sda2): mounted filesystem with ordered data mode. Quota mode: none.
[    4.681012] VFS: Mounted root (ext4 filesystem) readonly on device 8:2.
[    4.681835] devtmpfs: mounted
[    4.689846] Freeing unused kernel memory: 4160K
[    4.690043] Run /sbin/init as init process
[    4.690054]   with arguments:
[    4.690063]     /sbin/init
[    4.690073]     splash
[    4.690083]   with environment:
[    4.690091]     HOME=/
[    4.690100]     TERM=linux
[    4.844466] systemd[1]: System time before build time, advancing clock.
[    4.994246] NET: Registered PF_INET6 protocol family
[    4.996172] Segment Routing with IPv6
[    4.996215] In-situ OAM (IOAM) with IPv6
[    5.040477] systemd[1]: systemd 247.3-7+deb11u2 running in system mode. (+PAM +AUDIT +SELINUX +IMA +APPARMOR +SMACK +SYSVINIT +UTMP +LIBCRYPTSETUP +GCRYPT +GNUTLS +ACL +XZ +LZ4 +ZSTD +SECCOMP +BLKID +ELFUTILS +KMOD +IDN2 -IDN +PCRE2 default-hierarchy=unified)
[    5.041474] systemd[1]: Detected architecture arm64.
[    5.042589] systemd[1]: Set hostname to <welleri>.
[    5.573611] systemd[1]: /lib/systemd/system/plymouth-start.service:16: Unit configured to use KillMode=none. This is unsafe, as it disables systemd's process lifecycle management for the service. Please update your service to use a safer KillMode=, such as 'mixed' or 'control-group'. Support for KillMode=none is deprecated and will eventually be removed.
[    5.703045] systemd[1]: Queued start job for default target Graphical Interface.
[    5.769751] systemd[1]: Created slice system-getty.slice.
[    5.771966] systemd[1]: Created slice system-modprobe.slice.
[    5.773769] systemd[1]: Created slice system-systemd\x2dfsck.slice.
[    5.775360] systemd[1]: Created slice User and Session Slice.
[    5.775890] systemd[1]: Started Forward Password Requests to Wall Directory Watch.
[    5.776959] systemd[1]: Set up automount Arbitrary Executable File Formats File System Automount Point.
[    5.777418] systemd[1]: Reached target Slices.
[    5.777551] systemd[1]: Reached target Swap.
[    5.778575] systemd[1]: Listening on Syslog Socket.
[    5.779273] systemd[1]: Listening on fsck to fsckd communication Socket.
[    5.779647] systemd[1]: Listening on initctl Compatibility Named Pipe.
[    5.780863] systemd[1]: Listening on Journal Audit Socket.
[    5.781642] systemd[1]: Listening on Journal Socket (/dev/log).
[    5.782693] systemd[1]: Listening on Journal Socket.
[    5.785405] systemd[1]: Listening on udev Control Socket.
[    5.786262] systemd[1]: Listening on udev Kernel Socket.
[    5.787289] systemd[1]: Condition check resulted in Huge Pages File System being skipped.
[    5.792405] systemd[1]: Mounting POSIX Message Queue File System...
[    5.797924] systemd[1]: Mounting RPC Pipe File System...
[    5.804390] systemd[1]: Mounting Kernel Debug File System...
[    5.810659] systemd[1]: Mounting Kernel Trace File System...
[    5.811372] systemd[1]: Condition check resulted in Kernel Module supporting RPCSEC_GSS being skipped.
[    5.820191] systemd[1]: Starting Restore / save the current clock...
[    5.840380] systemd[1]: Starting Set the console keyboard layout...
[    5.846833] systemd[1]: Starting Create list of static device nodes for the current kernel...
[    5.852435] systemd[1]: Starting Load Kernel Module configfs...
[    5.857843] systemd[1]: Starting Load Kernel Module drm...
[    5.867750] systemd[1]: Starting Load Kernel Module fuse...
[    5.870231] systemd[1]: Condition check resulted in Set Up Additional Binary Formats being skipped.
[    5.876593] systemd[1]: Starting File System Check on Root Device...
[    5.887285] systemd[1]: Starting Journal Service...
[    5.895870] systemd[1]: Starting Load Kernel Modules...
[    5.902288] systemd[1]: Starting Coldplug All udev Devices...
[    5.920058] systemd[1]: Mounted POSIX Message Queue File System.
[    5.920944] systemd[1]: Mounted RPC Pipe File System.
[    5.921671] systemd[1]: Mounted Kernel Debug File System.
[    5.922423] systemd[1]: Mounted Kernel Trace File System.
[    5.924975] systemd[1]: Finished Restore / save the current clock.
[    5.928264] systemd[1]: Finished Create list of static device nodes for the current kernel.
[    5.934700] systemd[1]: modprobe@configfs.service: Succeeded.
[    5.936470] systemd[1]: Finished Load Kernel Module configfs.
[    5.943775] systemd[1]: Mounting Kernel Configuration File System...
[    5.964426] systemd[1]: Mounted Kernel Configuration File System.
[    5.974940] fuse: init (API version 7.37)
[    5.977902] systemd[1]: Started File System Check Daemon to report status.
[    5.988673] systemd[1]: modprobe@fuse.service: Succeeded.
[    5.990152] systemd[1]: Finished Load Kernel Module fuse.
[    6.000042] i2c_dev: i2c /dev entries driver
[    6.002836] systemd[1]: Mounting FUSE Control File System...
[    6.015570] systemd[1]: Finished Load Kernel Modules.
[    6.021868] systemd[1]: Starting Apply Kernel Variables...
[    6.028248] systemd[1]: Mounted FUSE Control File System.
[    6.081582] systemd[1]: Finished Apply Kernel Variables.
[    6.091368] systemd[1]: modprobe@drm.service: Succeeded.
[    6.092842] systemd[1]: Finished Load Kernel Module drm.
[    6.336895] systemd[1]: Started Journal Service.
[    6.518519] EXT4-fs (sda2): re-mounted. Quota mode: none.
[    6.608324] systemd-journald[141]: Received client request to flush runtime journal.
[    6.644335] systemd-journald[141]: File /var/log/journal/fc19aee517bf4fe3ade438f1591af2df/system.journal corrupted or uncleanly shut down, renaming and replacing.
[    7.557341] mc: Linux media interface: v0.10
[    7.623239] vc_sm_cma: module is from the staging directory, the quality is unknown, you have been warned.
[    7.645046] bcm2835_vc_sm_cma_probe: Videocore shared memory driver
[    7.645111] [vc_sm_connected_init]: start
[    7.661301] [vc_sm_connected_init]: installed successfully
[    7.685434] brcmstb-i2c fef04500.i2c:  @97500hz registered in polling mode
[    7.688622] brcmstb-i2c fef09500.i2c:  @97500hz registered in polling mode
[    7.806556] snd_bcm2835: module is from the staging directory, the quality is unknown, you have been warned.
[    7.832656] bcm2835_audio bcm2835_audio: card created with 8 channels
[    7.842332] videodev: Linux video capture interface: v2.00
[    8.095647] [drm] Initialized v3d 1.0.0 20180419 for fec00000.v3d on minor 0
[    8.128527] bcm2835_mmal_vchiq: module is from the staging directory, the quality is unknown, you have been warned.
[    8.129602] bcm2835_mmal_vchiq: module is from the staging directory, the quality is unknown, you have been warned.
[    8.236529] bcm2835_isp: module is from the staging directory, the quality is unknown, you have been warned.
[    8.247055] bcm2835_v4l2: module is from the staging directory, the quality is unknown, you have been warned.
[    8.249122] bcm2835_codec: module is from the staging directory, the quality is unknown, you have been warned.
[    8.249200] rpivid_hevc: module is from the staging directory, the quality is unknown, you have been warned.
[    8.268412] bcm2835-isp bcm2835-isp: Device node output[0] registered as /dev/video13
[    8.269580] bcm2835-isp bcm2835-isp: Device node capture[0] registered as /dev/video14
[    8.275706] cfg80211: Loading compiled-in X.509 certificates for regulatory database
[    8.275943] bcm2835-isp bcm2835-isp: Device node capture[1] registered as /dev/video15
[    8.276668] bcm2835-isp bcm2835-isp: Device node stats[2] registered as /dev/video16
[    8.276710] bcm2835-isp bcm2835-isp: Register output node 0 with media controller
[    8.276732] bcm2835-isp bcm2835-isp: Register capture node 1 with media controller
[    8.276751] bcm2835-isp bcm2835-isp: Register capture node 2 with media controller
[    8.276767] bcm2835-isp bcm2835-isp: Register capture node 3 with media controller
[    8.287022] bcm2835-codec bcm2835-codec: Device registered as /dev/video10
[    8.287081] bcm2835-codec bcm2835-codec: Loaded V4L2 decode
[    8.290997] rpivid feb10000.codec: Device registered as /dev/video19
[    8.291125] sd 0:0:0:0: Attached scsi generic sg0 type 0
[    8.292658] bcm2835-codec bcm2835-codec: Device registered as /dev/video11
[    8.292720] bcm2835-codec bcm2835-codec: Loaded V4L2 encode
[    8.298147] bcm2835-isp bcm2835-isp: Device node output[0] registered as /dev/video20
[    8.300003] bcm2835-isp bcm2835-isp: Device node capture[0] registered as /dev/video21
[    8.302906] bcm2835-isp bcm2835-isp: Device node capture[1] registered as /dev/video22
[    8.303397] bcm2835-isp bcm2835-isp: Device node stats[2] registered as /dev/video23
[    8.303433] bcm2835-isp bcm2835-isp: Register output node 0 with media controller
[    8.303460] bcm2835-isp bcm2835-isp: Register capture node 1 with media controller
[    8.303491] bcm2835-isp bcm2835-isp: Register capture node 2 with media controller
[    8.303508] bcm2835-isp bcm2835-isp: Register capture node 3 with media controller
[    8.303760] bcm2835-isp bcm2835-isp: Loaded V4L2 bcm2835-isp
[    8.307612] cfg80211: Loaded X.509 cert 'sforshee: 00b28ddf47aef9cea7'
[    8.313718] cfg80211: loaded regulatory.db is malformed or signature is missing/invalid
[    8.326218] bcm2835-codec bcm2835-codec: Device registered as /dev/video12
[    8.326300] bcm2835-codec bcm2835-codec: Loaded V4L2 isp
[    8.330472] bcm2835-codec bcm2835-codec: Device registered as /dev/video18
[    8.330531] bcm2835-codec bcm2835-codec: Loaded V4L2 image_fx
[    8.337989] bcm2835-codec bcm2835-codec: Device registered as /dev/video31
[    8.338064] bcm2835-codec bcm2835-codec: Loaded V4L2 encode_image
[    8.436793] brcmfmac: F1 signature read @0x18000000=0x15264345
[    8.445784] brcmfmac: brcmf_fw_alloc_request: using brcm/brcmfmac43455-sdio for chip BCM4345/6
[    8.455062] usbcore: registered new interface driver brcmfmac
[    8.686663] brcmfmac: brcmf_c_preinit_dcmds: Firmware: BCM4345/6 wl0: Nov  1 2021 00:37:25 version 7.45.241 (1a2f2fa CY) FWID 01-703fd60
[    8.687080] vc4-drm gpu: bound fe400000.hvs (ops vc4_hvs_ops [vc4])
[    8.721470] Registered IR keymap rc-cec
[    8.721671] rc rc0: vc4-hdmi-0 as /devices/platform/soc/fef00700.hdmi/rc/rc0
[    8.721899] input: vc4-hdmi-0 as /devices/platform/soc/fef00700.hdmi/rc/rc0/input0
[    8.726969] vc4-drm gpu: bound fef00700.hdmi (ops vc4_hdmi_ops [vc4])
[    8.729684] Registered IR keymap rc-cec
[    8.729887] rc rc1: vc4-hdmi-1 as /devices/platform/soc/fef05700.hdmi/rc/rc1
[    8.730099] input: vc4-hdmi-1 as /devices/platform/soc/fef05700.hdmi/rc/rc1/input1
[    8.733504] vc4-drm gpu: bound fef05700.hdmi (ops vc4_hdmi_ops [vc4])
[    8.734099] vc4-drm gpu: bound fe004000.txp (ops vc4_txp_ops [vc4])
[    8.734636] vc4-drm gpu: bound fe206000.pixelvalve (ops vc4_crtc_ops [vc4])
[    8.735123] vc4-drm gpu: bound fe207000.pixelvalve (ops vc4_crtc_ops [vc4])
[    8.735558] vc4-drm gpu: bound fe20a000.pixelvalve (ops vc4_crtc_ops [vc4])
[    8.735851] vc4-drm gpu: bound fe216000.pixelvalve (ops vc4_crtc_ops [vc4])
[    8.736307] vc4-drm gpu: bound fec12000.pixelvalve (ops vc4_crtc_ops [vc4])
[    8.740278] [drm] Initialized vc4 0.0.0 20140616 for gpu on minor 1
[    8.934338] Console: switching to colour frame buffer device 100x30
[    8.953376] vc4-drm gpu: [drm] fb0: vc4drmfb frame buffer device
[   10.176225] 8021q: 802.1Q VLAN Support v1.8
[   10.525420] uart-pl011 fe201000.serial: no DMA platform data
[   10.690634] Adding 102396k swap on /var/swap.  Priority:-2 extents:5 across:232902656k SSFS
[   10.844286] brcmfmac: brcmf_cfg80211_set_power_mgmt: power save enabled
[   11.235444] bcmgenet fd580000.ethernet: configuring instance for external RGMII (RX delay)
[   11.241484] bcmgenet fd580000.ethernet eth0: Link is Down
[   15.282849] bridge: filtering via arp/ip/ip6tables is no longer available by default. Update your scripts to load br_netfilter if you need this.
[   15.286093] Bridge firewalling registered
[   15.326534] bcmgenet fd580000.ethernet eth0: Link is Up - 1Gbps/Full - flow control rx/tx
[   15.326579] IPv6: ADDRCONF(NETDEV_CHANGE): eth0: link becomes ready
[   15.467075] Initializing XFRM netlink socket
[   16.971027] systemd-journald[141]: File /var/log/journal/fc19aee517bf4fe3ade438f1591af2df/user-1000.journal corrupted or uncleanly shut down, renaming and replacing.
[   17.499509] br-af637c9bbb91: port 1(vethf390115) entered blocking state
[   17.499532] br-af637c9bbb91: port 1(vethf390115) entered disabled state
[   17.499873] device vethf390115 entered promiscuous mode
[   17.570202] IPv6: ADDRCONF(NETDEV_CHANGE): veth8f7870a: link becomes ready
[   17.570318] IPv6: ADDRCONF(NETDEV_CHANGE): vethf390115: link becomes ready
[   17.570414] br-af637c9bbb91: port 1(vethf390115) entered blocking state
[   17.570424] br-af637c9bbb91: port 1(vethf390115) entered forwarding state
[   17.570522] IPv6: ADDRCONF(NETDEV_CHANGE): br-af637c9bbb91: link becomes ready
[   18.413149] Bluetooth: Core ver 2.22
[   18.413264] NET: Registered PF_BLUETOOTH protocol family
[   18.413273] Bluetooth: HCI device and connection manager initialized
[   18.413296] Bluetooth: HCI socket layer initialized
[   18.413308] Bluetooth: L2CAP socket layer initialized
[   18.413328] Bluetooth: SCO socket layer initialized
[   18.516062] Bluetooth: HCI UART driver ver 2.3
[   18.516094] Bluetooth: HCI UART protocol H4 registered
[   18.516184] Bluetooth: HCI UART protocol Three-wire (H5) registered
[   18.516383] Bluetooth: HCI UART protocol Broadcom registered
[   20.130862] br-af637c9bbb91: port 1(vethf390115) entered disabled state
[   20.132129] eth0: renamed from veth8f7870a
[   20.167669] br-af637c9bbb91: port 1(vethf390115) entered blocking state
[   20.167692] br-af637c9bbb91: port 1(vethf390115) entered forwarding state
[   20.581273] Bluetooth: BNEP (Ethernet Emulation) ver 1.3
[   20.581295] Bluetooth: BNEP filters: protocol multicast
[   20.581311] Bluetooth: BNEP socket layer initialized
[   20.589216] Bluetooth: MGMT ver 1.22
[   20.614584] NET: Registered PF_ALG protocol family
[   21.909348] Bluetooth: RFCOMM TTY layer initialized
[   21.909382] Bluetooth: RFCOMM socket layer initialized
[   21.909403] Bluetooth: RFCOMM ver 1.11
[   26.522368] usb 1-1.4: new low-speed USB device number 3 using xhci_hcd
[   26.629823] usb 1-1.4: New USB device found, idVendor=093a, idProduct=2510, bcdDevice= 1.00
[   26.629845] usb 1-1.4: New USB device strings: Mfr=1, Product=2, SerialNumber=0
[   26.629851] usb 1-1.4: Product: USB OPTICAL MOUSE
[   26.629856] usb 1-1.4: Manufacturer: PIXART
[   26.640788] input: PIXART USB OPTICAL MOUSE as /devices/platform/scb/fd500000.pcie/pci0000:00/0000:00:00.0/0000:01:00.0/usb1/1-1/1-1.4/1-1.4:1.0/0003:093A:2510.0001/input/input2
[   26.641251] hid-generic 0003:093A:2510.0001: input,hidraw0: USB HID v1.11 Mouse [PIXART USB OPTICAL MOUSE] on usb-0000:01:00.0-1.4/input0
[  192.578431] usb 1-1.3: new low-speed USB device number 4 using xhci_hcd
[  192.686096] usb 1-1.3: New USB device found, idVendor=413c, idProduct=2005, bcdDevice= 1.05
[  192.686125] usb 1-1.3: New USB device strings: Mfr=1, Product=2, SerialNumber=0
[  192.686139] usb 1-1.3: Product: DELL USB Keyboard
[  192.686152] usb 1-1.3: Manufacturer: DELL
[  192.695729] input: DELL DELL USB Keyboard as /devices/platform/scb/fd500000.pcie/pci0000:00/0000:00:00.0/0000:01:00.0/usb1/1-1/1-1.3/1-1.3:1.0/0003:413C:2005.0002/input/input3
[  192.755331] hid-generic 0003:413C:2005.0002: input,hidraw1: USB HID v1.10 Keyboard [DELL DELL USB Keyboard] on usb-0000:01:00.0-1.3/input0
[  208.283462] IPv6: ADDRCONF(NETDEV_CHANGE): wlan0: link becomes ready
[  396.932193] usb 1-1.3: USB disconnect, device number 4
[  828.101864] usb 1-1.4: USB disconnect, device number 3
[  969.723396] bcmgenet fd580000.ethernet eth0: Link is Down
[ 3902.505033] bcmgenet fd580000.ethernet eth0: Link is Up - 1Gbps/Full - flow control rx/tx

EEPROM
------

BOOTLOADER: up to date
   CURRENT: Wed Jan 11 17:40:52 UTC 2023 (1673458852)
    LATEST: Wed Jan 11 17:40:52 UTC 2023 (1673458852)
   RELEASE: default (/lib/firmware/raspberrypi/bootloader/default)
            Use raspi-config to change the release.

  VL805_FW: Using bootloader EEPROM
     VL805: up to date
   CURRENT: 000138c0
    LATEST: 000138c0
#+end_example


*** ~create-dir~

#+name: create-dir
#+BEGIN_SRC bash :eval no-export :results output :var DIR="stage"
# DIR=stage
echo "Create DIR=$DIR in host='$(hostname)' on $(date)"
( [ ! -d $DIR ] && mkdir $DIR  && echo Directory $DIR created ) || echo Directory $DIR already exists 
#+END_SRC



* Fin                                                              :noexport:


** Emacs variables

#+RESULTS:

# Local Variables:
# time-stamp-line-limit: -8
# time-stamp-start: "Modified:"
# time-stamp-format: "%:y-%02m-%02d.%02H:%02M"
# time-stamp-time-zone: nil
# time-stamp-end: "; # time-stamp"
# eval: (add-hook 'before-save-hook 'time-stamp)
# org-confirm-babel-evaluate: nil
# End:
#
# Muuta
# org-cdlatex-mode: t
# eval: (cdlatex-mode)
#
# Local ebib:
# org-ref-default-bibliography: "./DEVELOPMENT.bib"
# org-ref-bibliography-notes: "./DEVELOPMENT-notes.org"
# org-ref-pdf-directory: "./pdf/"
# org-ref-notes-directory: "."
# bibtex-completion-notes-path: "./DEVELOPMENT-notes.org"
# ebib-preload-bib-files: ("./DEVELOPMENT.bib")
# ebib-notes-file: ("./DEVELOPMENT-notes.org")
# reftex-default-bibliography: ("./DEVELOPMENT.bib")


Modified:2025-07-03.11:53; # time-stamp
